{"data":{"markdownRemark":{"html":"<p>We believe in the power of open data -- standardized, machine-readable, trustworthy, and publicly accessible data that anyone can use and redistribute. When data is open, so are opportunities for creativity, collaboration, and innovation.   </p>\n<p>DKAN is a community-driven, Drupal-based open data platform used worldwide by governments of all levels, nonprofits, international organizations, and private companies.  </p>\n<p>The original developers of DKAN and its core maintainers work at CivicActions, continually improving the product according to the needs of the community and the most up to date technology while providing outstanding services to our clients.   </p>\n<p><strong>CivicActions DKAN services include:</strong></p>\n<ul>\n<li>Implementation of your open data platform from start to finish</li>\n<li>New features and modifications to meet your unique needs</li>\n<li>Support through upgrades, helpdesk services, and more</li>\n<li>Training for your technical and program staff on using and developing the platform in keeping with open data best practices</li>\n<li>SaaS hosted versions of DKAN with enterprise support, uptime SLAs, and federal-level security compliance</li>\n</ul>\n<p><strong>CivicActions provides DKAN implementation, support, and training for:</strong></p>\n<ul>\n<li>Federal, state, or local government agencies seeking to share information about education, the environment, health care, transportation, and more</li>\n<li>Companies looking to share data across their organization</li>\n<li>Citizens, researchers, students, and journalists who wish to access public data and make use of it</li>\n<li>Non-profits, NGOs, or universities that want to open up their research findings</li>\n</ul>","frontmatter":{"title":"Dkan and Open Data","subtitle":"We use DKAN to help organizations all over the world comply with open data mandates and use their data to demonstrate accomplishments, educate the public, and empower people to improve their communities.","features_title":"DKAN Features","features":[{"title":"Datasets","caption":"with robust, standards-compliant metadata options, including custom fields","alt":"Datasets, with robust, standards-compliant metadata options, including custom fields","icon":{"publicURL":"/civicactions.com/static/datasets-e71359276845dc4d5a777cd6524a0fb1.svg"}},{"title":"Resources","caption":"in almost any format from csv to pdf to geojson and many more","alt":"Resources, in almost any format from csv to pdf to geojson and many more","icon":{"publicURL":"/civicactions.com/static/resources-0abf7c01ace160002653d2ef192fe7dd.svg"}},{"title":"Visualizations","caption":"and data previews in table, chart, and map form","alt":"Visualizations and data previews in table, chart, and map form","icon":{"publicURL":"/civicactions.com/static/visualization-36f1d316815214c71ddf8cb4178cad28.svg"}},{"title":"Search","caption":"by title, metadata, tags, descriptions, publisher, and custom options","alt":"Search by title, metadata, tags, descriptions, publisher, and custom options","icon":{"publicURL":"/civicactions.com/static/search-8613e19a830a1f400f1b88fec992848f.svg"}},{"title":"Data stories","caption":"to create compelling narratives around your data","alt":"Data stories to create compelling narratives around your data","icon":{"publicURL":"/civicactions.com/static/stories-7606c9bec86e45b9beb5a9f3af46ea49.svg"}},{"title":"Groups","caption":"to manage permissions and organize data by publisher","alt":"Groups to manage permissions and organize data by publisher","icon":{"publicURL":"/civicactions.com/static/groups-eb5a62dabd19be194cf386bce977f084.svg"}},{"title":"Internationalization","caption":"options so your platform works for users anywhere in the world","alt":"Internationalization options so your platform works for users anywhere in the world","icon":{"publicURL":"/civicactions.com/static/internationalization-3ffb8c59892c205121a02db1a085d0b9.svg"}},{"title":"Workflows","caption":"to support your data curation process","alt":"Workflows to support your data curation process","icon":{"publicURL":"/civicactions.com/static/workflows-14c6f1a0a182776cb0e32a04e00ba9b1.svg"}},{"title":"Harvest data","caption":"from other sources for a seamless experience between locally and remotely hosted files","alt":"Harvest data from other sources for a seamless experience between locally and remotely hosted files","icon":{"publicURL":"/civicactions.com/static/harvest-48d7f891be6940767652990fa10522f0.svg"}}]}}},"pageContext":{}}