{"data":{"markdownRemark":{"html":"<h3>Approach</h3>\n<h5>Agile development to keep big projects on budget</h5>\n<p>DSCA challenged the status quo by choosing a fixed-price agile contract, moving away from traditional waterfall approaches that doom many government IT projects to failure. Our agile process kept the GlobalNET project efficient and on budget.</p>\n<h5>Smooth content migration</h5>\n<p>We developed an automatic migration of 550,000 pages, 589,040 files, and 65,000 user accounts from a legacy Drupal 6 site into a fully redesigned Drupal 7 site. A rolling launch schedule helped us minimize downtime for users.</p>\n<h5>Responsive and “mobile-first” design</h5>\n<p>GlobalNET participants need to use sophisticated community tools in a variety of situations, so we built the platform using a “mobile-first” approach, ensuring its accessibility on any device from anywhere in the world</p>\n<h5>Security is never “done”</h5>\n<p>Adhering to strict DoD guidelines ensured we met DCSA’s unique security needs. We not only followed all compliance regulations, we constantly looked for ways to improve security processes, compensate for possible weakness, and plan for emergencies.</p>\n<h5>Thoughtful design and helpful support</h5>\n<p>Talking to GlobalNET users helps us learn what is most important to them before we create new features. As a result of user feedback, we restructured tools, interfaces, and search experiences to make the platform more intuitive and useful, while providing enhanced support for end-user problems.</p>\n<h5>Tools for learning and sharing</h5>\n<p>We created tools and groups to help DSCA partners work together online. Teachers can share their syllabus, course materials, and announcements, while students can participate in discussions and upload coursework. Each GlobalNET user has a personalized dashboard to keep track of messages, contacts, courses, and events.</p>\n<h5>DevOps for continuous improvement</h5>\n<p>We used open source tools for continuous integration and continuous delivery (CI/CD) and helped DSCA build up their DevOps practices. The agency can continue to improve GlobalNET in the future while maintaining strong security and quality code.</p>\n<h5>Sharing our work</h5>\n<p>We used 100% open source licensed components (except EZproxy and Adobe Connect) in developing GlobalNET. The entire codebase was itself released as an <a href=\"https://github.com/CivicActions/globalnet\">open source project</a>, for review or comment by other folks who would benefit from a similar system</p>\n<blockquote>\nIt was a pleasure to work with the CivicActions team. Their experience with government clients and agile processes helped us reach our user base sooner than expected with a product that met their needs. We have a happy group of stakeholders!\n<cite> -Lisa Berry, Senior GlobalNET Liaison Officer, Defense Security Cooperation Agency </cite>\n</blockquote>\n<h3>Impact</h3>\n<ul>\n<li>DSCA is better prepared to accomplish its mission with a more powerful platform</li>\n<li>GlobalNET members have a better experience for sharing, learning, and working together</li>\n<li>Partner organizations can use GlobalNET to keep their own communities informed</li>\n<li>Users can more easily find what they need among the site’s vast resources</li>\n<li>Participants engage more deeply with course materials and each other</li>\n<li>Future updates and improvements can be made safely and securely</li>\n<li>Agency can show the value of agile contracts with a successful project</li>\n</ul>\n<h3>Explore</h3>\n<h5>See our work</h5>\n<p><a href=\"https://globalnetplatform.org/\">GlobalNET</a></p>\n<h5>See the code</h5>\n<p><a href=\"https://github.com/CivicActions/globalnet\">GlobalNET repo in GitHub</a></p>\n<h5>Hear from a project manager</h5>\n<p><a href=\"https://medium.com/civicactions/one-platform-18-organizations-6-countries-and-9-launches-723016365468\">One Platform, 18 Organizations, 6 Countries, 9 Launches</a></p>\n<figure>\n  <div> \n    <header>805</header>\n    <p>agile user stories <br> created and solved <p>\n  </div>\n  <div> \n      <header>550</header>\n      <p>Behat tests run <br> with every code push <p>\n  </div>\n</figure>","frontmatter":{"path":"/case-study/globalnet","title":"Empowering international collaboration","client_name":"Defense Security Cooperation Agency","project":"GlobalNET","website":"https://globalnetplatform.org/","background_section_title":"Outdated technology and complex requirements","background_section":"The Defense Security Cooperation Agency (DSCA) uses the GlobalNET platform to facilitate secure collaboration among its partner organizations. GlobalNET’s 76,000 participants are comprised of military, diplomatic, law enforcement, and civilian government personnel throughout the world. They speak many languages and possess varying degrees of technical know-how, so GlobalNET must be accessible and easy to use for everyone -- while meeting the highest standards for security.\nGlobalNET needed an update to support new participants, additional features, and a better user experience. Multiple layers of customers and microservices made the project very complex. With over 1,500 content updates to the site per day, the modernization needed to be completed with minimal disruption to thousands of users. ","tags":["Drupal","DevOps","Security & Compliance","Quality Assurance","UX","Support"],"specs":["Drupal 7, Ilias, EZproxy, Adobe Connect, JIRA","Mobile-friendly, responsive design","SMS and solr search integration","FedRAMP compliant hosting","Shibboleth","MySQL","AWS services","Meets DoD FISMA network security requirements"],"images":[{"caption":"Presenting findings from discovery about LINCS user needs","alt":"LINCS Home page","url":{"childImageSharp":{"resize":{"src":"/civicactions.com/static/LINCS1-469ff5b1442001b7d8c01fd7449e406e-25c95.jpg"}}}},{"caption":"Visitors to the LINCS website can quickly find the resources they need","alt":"CivicActions meets with LINCS team and partners","url":{"childImageSharp":{"resize":{"src":"/civicactions.com/static/LINCS2-a39956c2a0531be03e1501d6cc701b13-25c95.jpg"}}}}]}},"allMarkdownRemark":{"totalCount":8,"edges":[{"node":{"frontmatter":{"client_name":"California Department of Motor Vehicles","title":"Improving the DMV experience","path":"/case-study/california-dmv","tags":["User Experience"],"preview_image":{"childImageSharp":{"resize":{"src":"/civicactions.com/static/DMV_1-66d54c5cb682e1c4008ed9a316625619-bd623.jpg"}}}}}},{"node":{"frontmatter":{"client_name":"California Polytechnic State University","title":"Improving transparency in state government","path":"/case-study/digital-democracy","tags":["Drupal","Open Data","DevOps","Quality Assurance"],"preview_image":{"childImageSharp":{"resize":{"src":"/civicactions.com/static/DD_1-7df4445045409ee727ae4a951189374a-bd623.jpg"}}}}}},{"node":{"frontmatter":{"client_name":"San Francisco Human Services Agency","title":"Helping Californians make healthy choices for life","path":"/case-study/EatFresh","tags":["User Experience","Drupal"],"preview_image":{"childImageSharp":{"resize":{"src":"/civicactions.com/static/LINCS1-469ff5b1442001b7d8c01fd7449e406e-bd623.jpg"}}}}}}]}},"pageContext":{}}