{"data":{"markdownRemark":{"html":"<p>Every project is about humans first —  the citizens and government employees whose daily lives will be affected by the quality of the work we do.   We combine this understanding with [our core values] and these methods:</p>\n<h3>Partnership</h3>\n<p>We assemble a team that pairs our expertise with your knowledge. We agree upon a designated “product owner.” This person acts as the voice of your organization during day-to-day development activities. [add something about understanding stakeholder ecosystem]</p>\n<h3>Discovery</h3>\n<p>Before building anything new, we learn about the current state of your service or system. Our team engages with your staff and users to develop a shared understanding of the problem we need to solve.</p>\n<h3>Iteration</h3>\n<p>The product owner manages prioritization, while our technical and design leads oversee the development of prototypes. Throughout the process, we test our work with users to gather feedback and adjust course as needed. </p>\n<h3>Reflection</h3>\n<p>Our team meets at the end of each iteration to acknowledge successes, identify issues, and discuss ways to improve. We maintain a continuous improvement mindset throughout the engagement.</p>","frontmatter":{"title":"Our Approach","subtitle":"From the adoption of modern technologies to the seeding of an agile culture that rewards innovation and learning, our approach is intended not only to deliver great services, but to position your agency for continued digital growth.","services_title":"What We Offer","services_subtitle":"Creating useful digital services in the 21st century requires all kinds of skills and technologies. Here are some things we can do to solve your complex challenges and help you gain the competencies for continuing success.","services":[{"title":"UX","caption":"Applying human-centered design to make user friendly experiences for your customers and team.","alt":"User Experience","icon":{"publicURL":"/civicactions.com/static/ux-cdf99cc2c4f89dfe774bbaf4a206560b.svg"}},{"title":"Open Data","caption":"Helping you comply with open data mandates, promote accessibility and use data for good.","alt":"Open Data","icon":{"publicURL":"/civicactions.com/static/open data-a8bfb395baef7abd8bf4291513263344.svg"}},{"title":"Security & Compliance","caption":"Developing systems and best practices for compliance, risk management and disaster recovery.","alt":"Security and Compliance","icon":{"publicURL":"/civicactions.com/static/security-a353337cd10264bce69a870b68b64142.svg"}},{"title":"Support","caption":"Providing empathetic technical support and applying user feedback to make services better.","alt":"Support","icon":{"publicURL":"/civicactions.com/static/support-2b4128f93a5eeff917970a334b845229.svg"}},{"title":"Drupal","caption":"Building fast, stable, well-designed websites and migrating content from legacy systems.","alt":"Drupal","icon":{"publicURL":"/civicactions.com/static/drupal-0efcb517ccfc023db4e80cbb3c0c9997.svg"}},{"title":"Devops","caption":"Establishing culture, technologies, and practices that drive continuous improvement.","alt":"Devops","icon":{"publicURL":"/civicactions.com/static/devops-3a2c51bf2527b3cffd896d141162f213.svg"}},{"title":"Education Services","caption":"Helping you gain digital competence with a people-first approach — agile, FOSS, Drupal, and more.","alt":"Education Services","icon":{"publicURL":"/civicactions.com/static/training-52c4bb67d690bf0da9496add0d6cab44.svg"}},{"title":"Quality Assurance","caption":"Using modern tools to continuously design and run tests for stable, sustainable systems.","alt":"Quality Assurance","icon":{"publicURL":"/civicactions.com/static/qa-4a07771613afc63392f4d229b64814c7.svg"}},{"title":"Innovation Lab","caption":"Doing the things that are new — from Internet of Things to bespoke solutions and beyond.","alt":"Innovation Lab","icon":{"publicURL":"/civicactions.com/static/innovation lab-e345e2459847fc3bbe66b00f1db53f40.svg"}}]}}},"pageContext":{}}